Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsValidCircuitNamingSchemeId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Verifies that the circuit naming scheme id can be used with Electrical Equipment.
aDocument:
The document.
circuitNamingSchemeId:
The circuit naming scheme id to be checked.
Returns:
True if the circuit naming scheme id is valid for Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.IsValidDistributionSystem(Autodesk.Revit.DB.Electrical.DistributionSysType)
Verifies that the Distribution System can be assigned to the Electrical Equipment.
distributionSystem:
The Distribution System to be checked.
Returns:
True if the Distribution System can be assigned to the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.CircuitNamingSchemeId
The CircuitNamingSchemeId used in the Electrical Equipment.
The CircuitNamingSchemeId is used to retrieve the circuit naming scheme id of the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The circuit naming scheme id is invalid for the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalEquipment.DistributionSystem
get or set the Distribution System for the Electrical Equipment.
Remarks:
This property returns a Distribution System which is assigned to the Electrical Equipment.
If there are no Distribution System assigned to this Electrical Equipment,
this property will be null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The Distribution System can not be assigned to the Electrical Equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.Electrical.ElectricalEquipment.#ctor(Autodesk.Revit.DB.FamilyInstance)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL